PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rram.c
/***************************************************************************//**
* \file cy_rram.c
* \version 1.10
*
* \brief
* Provides an API implementation of the RRAM driver.
*
********************************************************************************
* \copyright
* Copyright (c) 2022-2025, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_rram.h"
#ifdef WA__PM_0159902_6
    #include "cy_ipc_drv.h"
#endif
#if defined (CY_IP_MXS22RRAMC)
#include "cy_ms_ctl.h"

/*******************************************************************************
*       Internal Defines
*******************************************************************************/
/* Time out value is calculated considering worst case cycles required for 10ms with max core freq of 400MHz */
/* Make sure this delay is multiple of CY_RRAM_STATUS_CHECK_DELAY */
#define CY_RRAM_OPERATION_TIMEOUT                  (4000000UL)
/* Delay in cpu cycles before repeating the status check */
#define CY_RRAM_STATUS_CHECK_DELAY                 (50UL)
/* Maximum number of write trials */
#define CY_RRAM_MAX_WRITE_TRIALS                   (3UL)

/* RRAM read operation ECC fail status */
#define CY_RRAM_ECC_READ_NO_FAIL                   (0x00000000UL)                         /**< Read is success without any ECC fail */
#define CY_RRAM_ECC_READ_SINGLE_BIT_FAIL           RRAMC_RRAM_SFR_NVM_STATUS_ECC1READ_Msk /**< At least one ECC single-bit failure was detected and corrected during the last memory read operation */
#define CY_RRAM_ECC_READ_DOUBLE_BIT_FAIL           RRAMC_RRAM_SFR_NVM_STATUS_ECC2READ_Msk /**< At least one ECC double-bit failure was detected and corrected during the last memory read operation */
#define CY_RRAM_ECC_READ_TRIPLE_BIT_FAIL           RRAMC_RRAM_SFR_NVM_STATUS_ECC3READ_Msk /**< At least one ECC triple-bit failure was detected and corrected during the last memory read operation */
#define CY_RRAM_ECC_READ_MULTIPLE_BIT_FAIL         RRAMC_RRAM_SFR_NVM_STATUS_ECC4READ_Msk /**< At least one ECC-uncorrectable multi-bit failure was detected during the last memory read operation */
#define CY_RRAM_ECC_READ_ADDRESS_MISMATCH          RRAMC_RRAM_SFR_NVM_STATUS_ECCAREAD_Msk /**< At least one address mismatch ECC failure was detected during the last memory read operation */
#define CY_RRAM_ECC_READ_BLOCK_SINGLE_BIT_FAIL     RRAMC_RRAM_SFR_NVM_STATUS_ECC1MRD_Msk  /**< An ECC single-bit failure was detected and corrected during the most recent memory read operation to a new block */
#define CY_RRAM_ECC_READ_BLOCK_DOUBLE_BIT_FAIL     RRAMC_RRAM_SFR_NVM_STATUS_ECC2MRD_Msk  /**< An ECC double-bit failure was detected and corrected during the most recent memory read operation to a new block */
#define CY_RRAM_ECC_READ_BLOCK_TRIPLE_BIT_FAIL     RRAMC_RRAM_SFR_NVM_STATUS_ECC3MRD_Msk  /**< An ECC triple-bit failure was detected and corrected during the most recent memory read operation to a new block */
#define CY_RRAM_ECC_READ_BLOCK_MULTIPLE_BIT_FAIL   RRAMC_RRAM_SFR_NVM_STATUS_ECC4MRD_Msk  /**< An ECC-uncorrectable multi-bit failure was detected during the most recent memory read operation to a new block */
#define CY_RRAM_ECC_READ_BLOCK_ADDRESS_MISMATCH    RRAMC_RRAM_SFR_NVM_STATUS_ECCAMRD_Msk  /**< An address mismatch ECC failure was detected during the most recent memory read operation to a new block */

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 2, \
                             'Value extracted from _VAL2FLD macro will not exceed enum range.')

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 14.3', 12, \
                             'Because the size of work, flash subsection is zero but will be true if devices have valid size.')


/* RRAM config structure */
typedef struct
{
    RRAMC_Type *base;          /*!< The pointer to the RRAMC instance.*/
    uint32_t addr;             /*!< Address of the RRAM subregion.*/
    uint32_t subRegionBase;    /*!< Base address of subregion.*/
    uint32_t subRegionSize;    /*!< Size of subregion.*/
    bool blockingWrite;        /*!< To define blocking write for indirect write operation.*/
    bool tearingSafe;          /*!< Boolean to check if API is called from tearing safe library.*/
} cy_stc_rram_config_t;

typedef struct
{
    uint32_t base;    /*!< Base address of subregion.*/
    uint32_t size;    /*!< Size of subregion.*/
}  cy_stc_rram_rgn_info_t;

typedef union
{
    uint32_t w[4];    /*!< Store word data.*/
    uint8_t b[16];    /*!< Store byte data.*/
} cy_rram_blk_buf_t;


/*******************************************************************************
* Function Name: Cy_RRAM_AcquirePCLock
****************************************************************************//**
*
* Acquire a PC lock for RRAM to perform indirect operations.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_RRAM_AcquirePCLock(RRAMC_Type * base)
{
    bool status = false;
    uint32_t activePC;
    uint32_t savedIntrStatus;

    /* Enter Critical section */
    savedIntrStatus = Cy_SysLib_EnterCriticalSection();

#ifdef WA__PM_0159902_6
    if (CY_IPC_DRV_SUCCESS != Cy_IPC_Drv_LockAcquire(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_RRAM_LOCK)))
    {
        /* Exit Critical section */
        Cy_SysLib_ExitCriticalSection(savedIntrStatus);
        return false;
    }
#endif

    RRAM_PC_MASK(base) |= _VAL2FLD(RRAMC_RRAMC_PC_MASK_PC_LOCK, CY_RRAM_PC_LOCK_ACQUIRE);

    /* Get the value of active PC */
#if (CY_CPU_CORTEX_M0P)
    activePC = ((uint32_t)_FLD2VAL(M0SECCPUSS_CM0_MS_PC_PC, M0SECCPUSS_CM0_MS_PC));
#elif (CY_CPU_CORTEX_M33)
    activePC = Cy_Ms_Ctl_GetActivePC(CPUSS_MS_ID_CM33_0);
#else // CY_CPU_CORTEX_M55
    activePC = Cy_Ms_Ctl_GetActivePCV1(CPUSS_MS_ID_CM55_MS_0);
#endif

    if ((_FLD2VAL(RRAMC_RRAMC_PC_MASK_PC, RRAM_PC_MASK(base)) == activePC) && \
            (_FLD2VAL(RRAMC_RRAMC_PC_MASK_PC_LOCK, RRAM_PC_MASK(base)) == CY_RRAM_PC_LOCK_ACQUIRE))
    {
        status = true;
    }

    /* Exit Critical section */
    Cy_SysLib_ExitCriticalSection(savedIntrStatus);

