PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rram.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_ReleasePCLock
****************************************************************************//**
*
* Release PC lock.
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_ReleasePCLock(RRAMC_Type * base)
{
    RRAM_PC_MASK(base) &= ~RRAMC_RRAMC_PC_MASK_PC_LOCK_Msk;
#ifdef WA__PM_0159902_6
    (void)Cy_IPC_Drv_LockRelease(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_RRAM_LOCK), CY_IPC_NO_NOTIFICATION);
#endif
}


/*******************************************************************************
* Function Name: Cy_RRAM_IsPCLockAcquired
****************************************************************************//**
*
* Indicates whether PC lock is acquired or not.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_RRAM_IsPCLockAcquired(RRAMC_Type * base)
{
#ifdef WA__PM_0159902_6
    (void) base;
    return (Cy_IPC_Drv_IsLockAcquired(Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_RRAM_LOCK)));
#else
    return (_FLD2VAL(RRAMC_RRAMC_PC_MASK_PC_LOCK, RRAM_PC_MASK(base)) == CY_RRAM_PC_LOCK_ACQUIRE);
#endif
}


/*******************************************************************************
* Function Name: Cy_RRAM_SetOperationMode
****************************************************************************//**
*
* Sets operation mode refer cy_en_rram_operation_t for supported operations.
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_SetOperationMode(RRAMC_Type * base, cy_en_rram_operation_t operation)
{
    uint32_t temp = RRAM_NVM_PROG(base) & ~ RRAMC_RRAM_SFR_NVM_PROG_ACTION_Msk;
    RRAM_NVM_PROG(base) = temp | _VAL2FLD(RRAMC_RRAM_SFR_NVM_PROG_ACTION, operation);
}


/*******************************************************************************
* Function Name: Cy_RRAM_StartOperation
****************************************************************************//**
*
* Start the RRAM operation that is set by Cy_RRAM_SetOperationMode().
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_StartOperation(RRAMC_Type * base)
{
    RRAM_NVM_PROG(base) |= RRAMC_RRAM_SFR_NVM_PROG_STARTOP_Msk;
}

#if (CY_CPU_CORTEX_M0P)
/*******************************************************************************
* Function Name: Cy_RRAM_StopOperation
****************************************************************************//**
*
* Stop the RRAM operation that is set by Cy_RRAM_SetOperationMode().
*
*******************************************************************************/
__STATIC_INLINE void Cy_RRAM_StopOperation(RRAMC_Type * base)
{
    RRAM_NVM_PROG(base) &= ~RRAMC_RRAM_SFR_NVM_PROG_STARTOP_Msk;
}
#endif


/*******************************************************************************
* Function Name: CY_RRAM_GetFailBitInfo
****************************************************************************//**
*
* Information on number of fail bits for a block after verify in indirect
* write operation.
*
*******************************************************************************/
__STATIC_INLINE cy_en_rram_verr_status_t CY_RRAM_GetFailBitInfo(RRAMC_Type * base)
{
    return (cy_en_rram_verr_status_t)_FLD2VAL(RRAMC_RRAM_SFR_NVM_STATUS_VERR, RRAM_NVM_STATUS(base));
}


/*******************************************************************************
* Function Name: CY_RRAM_ReadOperationECCStatus
****************************************************************************//**
*
* Indicates ECC-status. ECC single, double and triple bit failures in read operation
* are treated as only warnings.
*
*******************************************************************************/
__STATIC_INLINE bool CY_RRAM_ReadOperationECCStatus(RRAMC_Type * base, uint32_t ecc_error)
{
    return (0U != (RRAM_NVM_STATUS(base) & ecc_error));
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetOTPSubRegionInfo
****************************************************************************//**
*
* Get base address, size of the OTP sub region for the provided address.
*
*******************************************************************************/
static cy_stc_rram_rgn_info_t Cy_RRAM_GetOTPSubRegionInfo(uint32_t addr)
{
    uint32_t secureBitState = addr & CY_RRAM_S_OFFSET_MASK;
    cy_stc_rram_rgn_info_t rgnInfo = {CY_RRAM_INVALID_ACCESS, 0UL};

    addr &= ~CY_RRAM_S_OFFSET_MASK;

    if ((addr >= CY_RRAM_GENERAL_OTP_MMIO_NS_START_ADDRESS) && (addr <= CY_RRAM_GENERAL_OTP_MMIO_NS_END_ADDRESS))
    {
        addr = CY_RRAM_GENERAL_OTP_MMIO_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_GENERAL_OTP_SIZE;
    }
    else if ((addr >= CY_RRAM_PROTECTED_OTP_PROTECTED_NS_START_ADDRESS) && (addr <= CY_RRAM_PROTECTED_OTP_PROTECTED_NS_END_ADDRESS))
    {
        addr = CY_RRAM_PROTECTED_OTP_PROTECTED_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_PROTECTED_OTP_SIZE;
    }
    else
    {
        secureBitState = 0UL;
    }

    addr |= secureBitState;
    rgnInfo.base = addr;

    return rgnInfo;
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetNVMSubRegionInfo
****************************************************************************//**
*
* Get base address, size of the NVM sub region for the provided address.
*
*******************************************************************************/
static cy_stc_rram_rgn_info_t Cy_RRAM_GetNVMSubRegionInfo(uint32_t addr)
{
    uint32_t secureBitState = addr & CY_RRAM_S_OFFSET_MASK;
    cy_stc_rram_rgn_info_t rgnInfo = {CY_RRAM_INVALID_ACCESS, 0UL};

    addr &= ~CY_RRAM_S_OFFSET_MASK;

    if ((addr >= CY_RRAM_MAIN_HOST_NS_START_ADDRESS) && (addr <= CY_RRAM_MAIN_HOST_NS_END_ADDRESS + CY_RRAM_PROTECTED_REGION_SIZE))
    {
        addr = CY_RRAM_MAIN_HOST_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_MAIN_REGION_SIZE + CY_RRAM_PROTECTED_REGION_SIZE;
    }
    else if ((addr >= CY_RRAM_WORK_HOST_NS_START_ADDRESS) && (addr <= CY_RRAM_WORK_HOST_NS_END_ADDRESS))
    {
        addr = CY_RRAM_WORK_HOST_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_WORK_REGION_SIZE;
    }
    else if ((addr >= CY_RRAM_SFLASH_HOST_NS_START_ADDRESS) && (addr <= CY_RRAM_SFLASH_HOST_NS_END_ADDRESS))
    {
        addr = CY_RRAM_SFLASH_HOST_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_SFLASH_REGION_SIZE;
    }
    else if ((addr >= CY_RRAM_PROTECTED_HOST_NS_START_ADDRESS) && (addr <= CY_RRAM_PROTECTED_HOST_NS_END_ADDRESS))
    {
        addr = CY_RRAM_PROTECTED_HOST_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_PROTECTED_REGION_SIZE;
    }
#if (CY_CPU_CORTEX_M0P)
    else if ((addr >= CY_RRAM_PROTECTED_PROTECTED_NS_START_ADDRESS) && (addr <= CY_RRAM_PROTECTED_PROTECTED_NS_END_ADDRESS))
    {
        addr = CY_RRAM_PROTECTED_PROTECTED_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_PROTECTED_REGION_SIZE;
    }
#endif
#if (CY_CPU_CORTEX_M33)
    else if ((addr >= CY_RRAM_MAIN_HOST_CBUS_NS_START_ADDRESS) && (addr <= CY_RRAM_MAIN_HOST_CBUS_NS_END_ADDRESS))
    {
        addr = CY_RRAM_MAIN_HOST_CBUS_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_MAIN_REGION_SIZE;
    }
    else if ((addr >= CY_RRAM_PROTECTED_HOST_CBUS_NS_START_ADDRESS) && (addr <= CY_RRAM_PROTECTED_HOST_CBUS_NS_END_ADDRESS))
    {
        addr = CY_RRAM_PROTECTED_HOST_CBUS_NS_START_ADDRESS;
        rgnInfo.size = CY_RRAM_PROTECTED_REGION_SIZE;
    }
#endif
    else
    {
        secureBitState = 0UL;
    }
    addr |= secureBitState;
    rgnInfo.base = addr;

