PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rram.c
    return rgnInfo;
}


/*******************************************************************************
* Function Name: Cy_RRAM_GetPhyBase
****************************************************************************//**
*
* Get the physical base address for the provided logical base address.
*
*******************************************************************************/
static uint32_t Cy_RRAM_GetPhyBase(uint32_t addr)
{
    uint32_t physicalAddr = 0;
    addr &= ~CY_RRAM_S_OFFSET_MASK;

    if (addr == CY_RRAM_MAIN_HOST_NS_START_ADDRESS)
    {
        physicalAddr = CY_RRAM_PHYSICAL_MAIN_BASE_ADDR;
    }
    else if (addr == CY_RRAM_WORK_HOST_NS_START_ADDRESS)
    {
        physicalAddr = CY_RRAM_PHYSICAL_WORK_BASE_ADDR;
    }
    else if (addr == CY_RRAM_SFLASH_HOST_NS_START_ADDRESS)
    {
        physicalAddr = CY_RRAM_PHYSICAL_SFLASH_BASE_ADDR;
    }
    else if (addr == CY_RRAM_PROTECTED_HOST_NS_START_ADDRESS)
    {
        physicalAddr = CY_RRAM_PHYSICAL_PROTECTED_BASE_ADDR;
    }
#if (CY_CPU_CORTEX_M0P)
    else if (addr == CY_RRAM_PROTECTED_PROTECTED_NS_START_ADDRESS)
    {
        physicalAddr = CY_RRAM_PHYSICAL_PROTECTED_BASE_ADDR;
    }
#endif
    else if (addr == CY_RRAM_GENERAL_OTP_MMIO_NS_START_ADDRESS)
    {
        physicalAddr = CY_RRAM_PHYSICAL_GENERAL_OTP_BASE_ADDR;
    }
    else
    {
        physicalAddr = CY_RRAM_PHYSICAL_PROTECTED_OTP_BASE_ADDR;
    }
    return physicalAddr;
}


/*******************************************************************************
* Function Name: Cy_RRAM_ReadBlock
****************************************************************************//**
*
* Read one of block data from the specified address.
*
*******************************************************************************/
static cy_en_rram_status_t Cy_RRAM_ReadBlock(cy_stc_rram_config_t * config, uint8_t * data, uint32_t pos, uint32_t numBytes)
{
    cy_rram_blk_buf_t blk;
    volatile uint32_t *readAddr = (uint32_t *) config->addr;
    cy_en_rram_status_t status = CY_RRAM_ECC_FAIL;
    uint32_t timeout;

    if (config->tearingSafe)
    {
        uint32_t phy_addr = Cy_RRAM_GetPhyBase(config->subRegionBase) +
                            ((config->addr - config->subRegionBase) / CY_RRAM_BLOCK_SIZE_BYTES);

        /* Set mode to idle to meet initialization condition. */
        Cy_RRAM_SetOperationMode(config->base, CY_RRAM_IDLE);

        /* Set operation mode to indirect write. */
        Cy_RRAM_SetOperationMode(config->base, CY_RRAM_INDIRECT_WRITE);

        /* Set the module-internal target address (physical address) */
        RRAM_NVM_ADDR(config->base) = phy_addr;

        timeout = CY_RRAM_OPERATION_TIMEOUT / CY_RRAM_STATUS_CHECK_DELAY;

        /* Wait until internal read operation is completed. As per RRAM IP team,
        * there is no need for timeout as the state machine will definitely
        * return to non-busy state. As a safety measure this timeout is added */
        while (Cy_RRAM_IsBusy(config->base) && (0UL != timeout))
        {
            timeout--;
            Cy_SysLib_DelayCycles(CY_RRAM_STATUS_CHECK_DELAY);
        }

        if (timeout == 0UL)
        {
            return CY_RRAM_OPERATION_TIME_OUT_ERROR;
        }

        /* Validate ECC status */
        if (!CY_RRAM_ReadOperationECCStatus(config->base, CY_RRAM_ECC_READ_BLOCK_MULTIPLE_BIT_FAIL))
        {
            /* Continue and read block, there is no uncorrectable ECC errors */
            status = CY_RRAM_SUCCESS;
        }

        /* Set mode to idle */
        Cy_RRAM_SetOperationMode(config->base, CY_RRAM_IDLE);
    }
    else
    {
        /* Set status to success if read operation is not called from TS library. */
        status = CY_RRAM_SUCCESS;
    }

    if (status == CY_RRAM_SUCCESS)
    {
        for (uint32_t wordCount = 0UL; wordCount < CY_RRAM_BLOCK_SIZE_WORDS; wordCount++)
        {
            blk.w[wordCount] = *readAddr++;
        }

        for (; numBytes != 0UL; --numBytes)
        {
            *data++ = blk.b[pos++];
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_SubRegionReadData
****************************************************************************//**
*
* Reads a number of bytes to a array from the provided address.
*
*******************************************************************************/
static cy_en_rram_status_t Cy_RRAM_SubRegionReadData(cy_stc_rram_config_t * config, uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    /* Validate the parameters */
    if ((config->subRegionSize - (config->addr - config->subRegionBase)) < numBytes)
    {
        return status;
    }
    else
    {
        /* The status is being set to SUCCESS in order to make one of the
           entry check for read aligned blocks case as true.
           While reading from an non-aligned block address the status will be overwritten
           based on result from Cy_RRAM_ReadBlock.*/
        status = CY_RRAM_SUCCESS;
    }

    /* Offset in bytes from block boundary */
    uint32_t offsetStart = config->addr & 0x0FUL;

    /* If the address is not aligned to the block boundary or the number of bytes to
    * read is less than one block
    */
    if (0UL != offsetStart)
    {
        uint32_t blkAlignedAddr = config->addr & ~0x0FUL;
        uint32_t bytesInFirstBlk = CY_RRAM_BLOCK_SIZE_BYTES - offsetStart;

        /* If there is more room in this block than the number of bytes to read */
        if (bytesInFirstBlk > numBytes)
        {
            bytesInFirstBlk = numBytes;
        }
        config->addr = blkAlignedAddr;
        status = Cy_RRAM_ReadBlock(config, data, offsetStart, bytesInFirstBlk);

        config->addr += CY_RRAM_BLOCK_SIZE_BYTES;
        numBytes  -= bytesInFirstBlk;
        data += bytesInFirstBlk;
    }

    /* Read complete 16-byte aligned blocks */
    uint32_t blockCount = numBytes / CY_RRAM_BLOCK_SIZE_BYTES;
    while (blockCount > 0UL)
    {
        if (CY_RRAM_SUCCESS != status)
        {
            break;
        }
        status = Cy_RRAM_ReadBlock(config, data, 0UL, CY_RRAM_BLOCK_SIZE_BYTES);
        config->addr += CY_RRAM_BLOCK_SIZE_BYTES;
        numBytes    -= CY_RRAM_BLOCK_SIZE_BYTES;
        data += CY_RRAM_BLOCK_SIZE_BYTES;
        blockCount --;
    }

