PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rram.c
    /* Read remaining bytes from the beginning of the last block */
    if ((0UL != numBytes) && (CY_RRAM_SUCCESS == status))
    {
        status = Cy_RRAM_ReadBlock(config, data, 0UL, numBytes);
    }

    return status;
}

/*
 * By default ECC Check is Enabled. This API is not meant for user. This API is used only during very early stage of
 * pre-silicon bring-up activity. During bring-up, RRAM test application can override this and disable ECC checking when tag
 * bits are being reset. Once the tag bits are reset, the test app can enable it so that ECC can be checked for normal
 * functionality of the driver.
 */

__WEAK bool cy_rram_should_check_ecc(void)
{
    return true;
}

/*******************************************************************************
* Function Name: Cy_RRAM_UpdateBlock
****************************************************************************//**
*
* Update one 16-byte RRAM block.
*
*******************************************************************************/
static cy_en_rram_status_t Cy_RRAM_UpdateBlock(cy_stc_rram_config_t * config, const uint8_t * data, uint32_t pos, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_ECC_FAIL;
    cy_rram_blk_buf_t blk;
    uint32_t timeout;
    volatile uint32_t *nvm_addr = (uint32_t *) config->addr;
    uint32_t phy_addr = Cy_RRAM_GetPhyBase(config->subRegionBase) + ((config->addr - config->subRegionBase) / CY_RRAM_BLOCK_SIZE_BYTES);

    bool is_otp = (((config->addr >= CY_RRAM_GENERAL_OTP_MMIO_NS_START_ADDRESS) && (config->addr <= CY_RRAM_GENERAL_OTP_MMIO_NS_END_ADDRESS)) ||
                   ((config->addr >= CY_RRAM_GENERAL_OTP_MMIO_S_START_ADDRESS) && (config->addr <= CY_RRAM_GENERAL_OTP_MMIO_S_END_ADDRESS)) ||
                   ((config->addr >= CY_RRAM_PROTECTED_OTP_PROTECTED_S_START_ADDRESS) && (config->addr <= CY_RRAM_PROTECTED_OTP_PROTECTED_S_END_ADDRESS)) ||
                   ((config->addr >= CY_RRAM_PROTECTED_OTP_PROTECTED_NS_START_ADDRESS) && (config->addr <= CY_RRAM_PROTECTED_OTP_PROTECTED_NS_END_ADDRESS)));

    /* Set the module-internal target address (physical address) */
    RRAM_NVM_ADDR(config->base) = phy_addr;

    timeout = CY_RRAM_OPERATION_TIMEOUT / CY_RRAM_STATUS_CHECK_DELAY;

    /* Wait until internal read operation is completed. As per RRAM IP team,
    * there is no need for timeout as the state machine will definitely
    * return to non-busy state. As a safety measure this timeout is added */
    while (Cy_RRAM_IsBusy(config->base) && (0UL != timeout))
    {
        timeout--;
        Cy_SysLib_DelayCycles(CY_RRAM_STATUS_CHECK_DELAY);
    }

    if (timeout == 0UL)
    {
        return CY_RRAM_OPERATION_TIME_OUT_ERROR;
    }

    /* Validate ECC status */
    if (CY_RRAM_ReadOperationECCStatus(config->base, CY_RRAM_ECC_READ_BLOCK_MULTIPLE_BIT_FAIL))
    {
        if ((!config->tearingSafe) && cy_rram_should_check_ecc())
        {
            return CY_RRAM_ECC_FAIL;
        }

        /* If the block is partially modified, fill block with zero. The block
        * content can't be read due to ECC error.
        */
        for (uint32_t wordCount = 0UL; wordCount < CY_RRAM_BLOCK_SIZE_WORDS; wordCount++)
        {
            blk.w[wordCount] = 0UL;
        }
    }
    else
    {
        /* If the block is partially modified or is located in OTP */
        if ((0UL != pos) || (numBytes < CY_RRAM_BLOCK_SIZE_BYTES) || is_otp)
        {
            for (uint32_t wordCount = 0UL; wordCount < CY_RRAM_BLOCK_SIZE_WORDS; wordCount++)
            {
                blk.w[wordCount] = nvm_addr[wordCount];
            }
        }
    }

    /* Update the block buffer with the data to be written */
    if (is_otp)
    {
        for (; numBytes != 0UL; --numBytes)
        {
            blk.b[pos++] |= *data++;
        }
    }
    else
    {
        for (; numBytes != 0UL; --numBytes)
        {
            blk.b[pos++] = *data++;
        }
    }

    /* Compare the NVM_ADDR register against the correct address before starting the write operation */
    if (RRAM_NVM_ADDR(config->base) != phy_addr)
    {
        return CY_RRAM_WRITE_OPERATION_ERROR;
    }

    if (config->blockingWrite)
    {
        for (uint32_t trials = 0; trials < CY_RRAM_MAX_WRITE_TRIALS; trials++)
        {
            /* Initiate AHB write transactions */
            for (uint32_t wordCount = 0UL; wordCount < CY_RRAM_BLOCK_SIZE_WORDS; wordCount++)
            {
                nvm_addr[wordCount] = blk.w[wordCount];
            }

            Cy_RRAM_StartOperation(config->base);

            timeout = CY_RRAM_OPERATION_TIMEOUT / CY_RRAM_STATUS_CHECK_DELAY;

            /* Check for the actual write completion. As per RRAM IP team,
            * there is no need for timeout as the state machine will definitely
            * return to non-busy state. As a safety measure this timeout is added */
            while (Cy_RRAM_IsBusy(config->base) && (0UL != timeout))
            {
                timeout--;
                Cy_SysLib_DelayCycles(CY_RRAM_STATUS_CHECK_DELAY);
            }

            if (timeout == 0UL)
            {
                status = CY_RRAM_OPERATION_TIME_OUT_ERROR;
                break;
            }

            cy_en_rram_verr_status_t verrStatus = CY_RRAM_GetFailBitInfo(config->base);

            /* if no error or single bit error then return success. After final trial if there is a two bit error then also return success */
            if ((verrStatus == CY_RRAM_NO_ERROR) ||
                    (verrStatus == CY_RRAM_SINGLE_BIT_ERROR) ||
                    ((verrStatus == CY_RRAM_DOUBLE_BIT_ERROR) && (trials == (CY_RRAM_MAX_WRITE_TRIALS - 1UL))))
            {
                status = CY_RRAM_SUCCESS;
                break;
            }
            /* For any error other than two or three bit and ECC uncorrectable bit error, return failure */
            else if ((verrStatus == CY_RRAM_ECC_ADDR_MISMATCH_ERROR) ||
                     (verrStatus == CY_RRAM_CONFIG_ERROR) ||
                     (verrStatus == CY_RRAM_ALGORITHM_ERROR))
            {
                status = CY_RRAM_VERR_BLOCK_FAIL_BITS;
                break;
            }
            /* Control will reach here when there is two bit or three bit or ECC Uncorrectable bit error. But it will reach here in the
               final trial only when there is three bit or ECC uncorrectable bit error */
            else
            {
                status = CY_RRAM_VERR_BLOCK_FAIL_BITS;
            }
        }
    }
    else
    {
        /* Initiate AHB write transactions */
        for (uint32_t wordCount = 0UL; wordCount < CY_RRAM_BLOCK_SIZE_WORDS; wordCount++)
        {
            nvm_addr[wordCount] = blk.w[wordCount];
        }
        Cy_RRAM_StartOperation(config->base);
        status = CY_RRAM_SUCCESS;
    }

