PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rram.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_SubRegionWriteData
****************************************************************************//**
*
* Writes a number of bytes starting from the provided target address.
*
*******************************************************************************/
static cy_en_rram_status_t Cy_RRAM_SubRegionWriteData(cy_stc_rram_config_t * config, const uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    if ((config->subRegionSize - (config->addr - config->subRegionBase)) < numBytes)
    {
        return status;
    }
    else
    {
        /* The status is being set to SUCCESS in order to make one of the
           entry check for only Write complete 16-byte aligned blocks case as true.
           While writing to a non-aligned block address the status will be overwritten
           based on result from Cy_RRAM_UpdateBlock.*/
        status = CY_RRAM_SUCCESS;
    }

    /* Set mode to idle to meet initialization condition */
    Cy_RRAM_SetOperationMode(config->base, CY_RRAM_IDLE);

    /* Set operation mode.to indirect write.*/
    Cy_RRAM_SetOperationMode(config->base, CY_RRAM_INDIRECT_WRITE);

    /* Offset in bytes from block boundary */
    uint32_t offsetStart = config->addr & 0x0FUL;

    /* If the address is not aligned to the block boundary or the number of bytes to
    * write is less than one block
    */
    if (0UL != offsetStart)
    {
        uint32_t blkAlignedAddr = config->addr & ~0x0FUL;
        uint32_t bytesInFirstBlk = CY_RRAM_BLOCK_SIZE_BYTES - offsetStart;

        /* If there is more room in this block than the number of bytes to write */
        if (bytesInFirstBlk > numBytes)
        {
            bytesInFirstBlk = numBytes;
        }

        config->addr = blkAlignedAddr;
        status = Cy_RRAM_UpdateBlock(config, data, offsetStart, bytesInFirstBlk);

        numBytes -= bytesInFirstBlk;
        data += bytesInFirstBlk;
        config->addr += CY_RRAM_BLOCK_SIZE_BYTES;
    }

    /* Write complete 16-byte aligned blocks */
    uint32_t blockCount = numBytes / CY_RRAM_BLOCK_SIZE_BYTES;
    for (uint32_t i = 0UL; i < blockCount; ++i)
    {
        if (CY_RRAM_SUCCESS != status)
        {
            break;
        }
        status = Cy_RRAM_UpdateBlock(config, data, 0UL, CY_RRAM_BLOCK_SIZE_BYTES);
        config->addr += CY_RRAM_BLOCK_SIZE_BYTES;
        numBytes    -= CY_RRAM_BLOCK_SIZE_BYTES;
        data += CY_RRAM_BLOCK_SIZE_BYTES;
    }

    /* Write remaining bytes at the beginning of the last block */
    if ((0UL != numBytes) && (CY_RRAM_SUCCESS == status))
    {
        status = Cy_RRAM_UpdateBlock(config, data, 0UL, numBytes);
    }

    /* Set mode to idle */
    Cy_RRAM_SetOperationMode(config->base, CY_RRAM_IDLE);

    return status;
}

/*******************************************************************************
* Function Name: Cy_RRAM_IsParamValid
****************************************************************************//**
*
* Validate the Parameters.
* Return true if the parameters are valid else return false
*
*******************************************************************************/
static bool Cy_RRAM_IsParamValid(RRAMC_Type *base, cy_stc_rram_rgn_info_t rgnInfo, uint32_t numBytes)
{
    if ((NULL != base) &&
            (rgnInfo.base != CY_RRAM_INVALID_ACCESS) &&
            (rgnInfo.size != CY_RRAM_INVALID_ACCESS) &&
            (numBytes > 0UL) && (numBytes <= rgnInfo.size))
    {
        return true;
    }
    else
    {
        return false;
    }
}

/*******************************************************************************
* Function Name: Cy_RRAM_OtpWriteByteArray
****************************************************************************//**
*
* Writes array of byte data to the specified address.
* The address should fall in General OTP or Protected OTP subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpWriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;
    cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetOTPSubRegionInfo(addr);

    if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
    {
        cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.size, true, false};

        if (!Cy_RRAM_IsPCLockAcquired(base))
        {
            /* Acquire a PC to confirm the transaction is effective. */
            if (Cy_RRAM_AcquirePCLock(base))
            {
                status = Cy_RRAM_SubRegionWriteData(&config, data, numBytes);
                Cy_RRAM_ReleasePCLock(base);
            }
            else
            {
                status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
            }
        }
        else
        {
            status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_OtpReadByteArray
****************************************************************************//**
*
* Reads array of byte data from the specified address.
* The address should fall in General OTP or Protected OTP subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpReadByteArray(RRAMC_Type * base, uint32_t addr, uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;
    cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetOTPSubRegionInfo(addr);

    if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
    {
        cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.base, false, false};
        status = Cy_RRAM_SubRegionReadData(&config, data, numBytes);
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_OtpWriteWord
****************************************************************************//**
*
* Writes a 32-bit word data to the specified address.
* The address should fall in General OTP or Protected OTP subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpWriteWord(RRAMC_Type * base, uint32_t addr, uint32_t data)
{
    return Cy_RRAM_OtpWriteByteArray(base, addr, (uint8_t *)(&data), 4UL);
}


