PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rram.c
/*******************************************************************************
* Function Name: Cy_RRAM_OtpReadWord
****************************************************************************//**
*
* Reads a 32bit word data from the specified address.
* The address should fall in General OTP or Protected OTP subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpReadWord(RRAMC_Type * base, uint32_t addr, uint32_t * data)
{
    return Cy_RRAM_OtpReadByteArray(base, addr, (uint8_t *)(data), 4UL);
}


/*******************************************************************************
* Function Name: Cy_RRAM_OtpWriteBlock
****************************************************************************//**
*
* Writes a block(16B) data to the specified address.
* The address should be block aligned.
* The address should fall in General OTP or Protected OTP subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_OtpWriteBlock(RRAMC_Type * base, uint32_t addr, uint8_t *data)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    if ((addr % CY_RRAM_BLOCK_SIZE_BYTES == 0UL))
    {
        status =  Cy_RRAM_OtpWriteByteArray(base, addr, data, CY_RRAM_BLOCK_SIZE_BYTES);
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_NvmWriteByteArray
****************************************************************************//**
*
* Writes array of byte data to the specified address in blocking mode.
* The address should fall in Main or Work or Sflash or Protected NVM subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_NvmWriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;
    cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetNVMSubRegionInfo(addr);

    if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
    {
        cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.size, true, false};

        if (!Cy_RRAM_IsPCLockAcquired(base))
        {
            /* Acquire a PC to confirm the transaction is effective. */
            if (Cy_RRAM_AcquirePCLock(base))
            {
                status = Cy_RRAM_SubRegionWriteData(&config, data, numBytes);
                Cy_RRAM_ReleasePCLock(base);
            }
            else
            {
                status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
            }
        }
        else
        {
            status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_NvmReadByteArray
****************************************************************************//**
*
* Reads array of byte data from the specified address.
* The address should fall in Main, Work, Sflash, Protected NVM subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_NvmReadByteArray(RRAMC_Type * base, uint32_t addr, uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;
    cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetNVMSubRegionInfo(addr);

    if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
    {
        cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.size, false, false};
        status = Cy_RRAM_SubRegionReadData(&config, data, numBytes);
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_NonBlockingNvmWriteByteArray
****************************************************************************//**
*
* Writes array of byte data to the specified address in Non Blocking mode.
* The address should fall in Main or Work or Sflash or Protected NVM subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_NonBlockingNvmWriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;
    cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetNVMSubRegionInfo(addr);

    if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
    {
        cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.size, false, false};

        if (!Cy_RRAM_IsPCLockAcquired(base))
        {
            /* Acquire a PC to confirm the transaction is effective. */
            if (Cy_RRAM_AcquirePCLock(base))
            {
                status = Cy_RRAM_SubRegionWriteData(&config, data, numBytes);
                Cy_RRAM_ReleasePCLock(base);
            }
            else
            {
                status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
            }
        }
        else
        {
            status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_NvmWriteBlock
****************************************************************************//**
*
* Writes a block(16B) data to the specified address in Blocking mode.
* The address should fall in Main or Work or Sflash or Protected NVM subsection.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_NvmWriteBlock(RRAMC_Type * base, uint32_t addr, uint8_t * data)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    if ((addr % CY_RRAM_BLOCK_SIZE_BYTES == 0UL))
    {
        status =  Cy_RRAM_NvmWriteByteArray(base, addr, data, CY_RRAM_BLOCK_SIZE_BYTES);
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_WriteByteArray
****************************************************************************//**
*
* Writes array of byte data to the provided RRAM address in blocking mode.
* API will wait for the write operation to be completed. It returns error or success status.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_WriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

