PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rram.c
    if (Cy_RRAM_GetNVMSubRegionInfo(addr).size != 0UL)
    {
        status = Cy_RRAM_NvmWriteByteArray(base, addr, data, numBytes);
    }
    else if (Cy_RRAM_GetOTPSubRegionInfo(addr).size != 0UL)
    {
        status = Cy_RRAM_OtpWriteByteArray(base, addr, data, numBytes);
    }
    else
    {
        status = CY_RRAM_BAD_PARAM;
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_RRAM_TSWriteByteArray
****************************************************************************//**
*
* Writes an array of byte data to the specified address in blocking mode without considering
* uncorrectable ECC fail error.
* This API should be used only for tearing safe use cases.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_TSWriteByteArray(RRAMC_Type * base, uint32_t addr, const uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    if (Cy_RRAM_GetNVMSubRegionInfo(addr).size != 0UL)
    {
        cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetNVMSubRegionInfo(addr);

        if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
        {
            cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.size, true, true};

            if (!Cy_RRAM_IsPCLockAcquired(base))
            {
                /* Acquire a PC to confirm the transaction is effective. */
                if (Cy_RRAM_AcquirePCLock(base))
                {
                    status = Cy_RRAM_SubRegionWriteData(&config, data, numBytes);
                    Cy_RRAM_ReleasePCLock(base);
                }
                else
                {
                    status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
                }
            }
            else
            {
                status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
            }
        }
    }
    else if (Cy_RRAM_GetOTPSubRegionInfo(addr).size != 0UL)
    {
        cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetOTPSubRegionInfo(addr);

        if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
        {
            cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.size, true, true};

            if (!Cy_RRAM_IsPCLockAcquired(base))
            {
                /* Acquire a PC to confirm the transaction is effective. */
                if (Cy_RRAM_AcquirePCLock(base))
                {
                    status = Cy_RRAM_SubRegionWriteData(&config, data, numBytes);
                    Cy_RRAM_ReleasePCLock(base);
                }
                else
                {
                    status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
                }
            }
            else
            {
                status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
            }
        }
    }
    else
    {
        status = CY_RRAM_BAD_PARAM;
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_ReadByteArray
****************************************************************************//**
*
* Reads a array of byte data from the provided RRAM address.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_ReadByteArray(RRAMC_Type * base, uint32_t addr, uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    if (Cy_RRAM_GetNVMSubRegionInfo(addr).size != 0UL)
    {
        status = Cy_RRAM_NvmReadByteArray(base, addr, data, numBytes);
    }
    else if (Cy_RRAM_GetOTPSubRegionInfo(addr).size != 0UL)
    {
        status = Cy_RRAM_OtpReadByteArray(base, addr, data, numBytes);
    }
    else
    {
        status = CY_RRAM_BAD_PARAM;
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_RRAM_TSReadByteArray
****************************************************************************//**
*
* Reads an array of byte data from the specified address after validating the
* uncorrectable ECC fail bits.
* Returns ECC fail error if uncorrectable ECC fail error exist.
* This API should be used only for tearing safe use cases.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_TSReadByteArray(RRAMC_Type * base, uint32_t addr, uint8_t * data, uint32_t numBytes)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    if (Cy_RRAM_GetNVMSubRegionInfo(addr).size != 0UL)
    {
        cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetNVMSubRegionInfo(addr);
        if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
        {
            cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.size, false, true};
            if (!Cy_RRAM_IsPCLockAcquired(base))
            {
                /* Acquire a PC to confirm the transaction is effective. */
                if (Cy_RRAM_AcquirePCLock(base))
                {
                    status = Cy_RRAM_SubRegionReadData(&config, data, numBytes);
                    Cy_RRAM_ReleasePCLock(base);
                }
                else
                {
                    status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
                }
            }
            else
            {
                status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
            }
        }
    }
    else if (Cy_RRAM_GetOTPSubRegionInfo(addr).size != 0UL)
    {
        cy_stc_rram_rgn_info_t rgnInfo = Cy_RRAM_GetOTPSubRegionInfo(addr);

        if (Cy_RRAM_IsParamValid(base, rgnInfo, numBytes) && NULL != data)
        {
            cy_stc_rram_config_t config = {base, addr, rgnInfo.base, rgnInfo.base, false, true};
            if (!Cy_RRAM_IsPCLockAcquired(base))
            {
                /* Acquire a PC to confirm the transaction is effective. */
                if (Cy_RRAM_AcquirePCLock(base))
                {
                    status = Cy_RRAM_SubRegionReadData(&config, data, numBytes);
                    Cy_RRAM_ReleasePCLock(base);
                }
                else
                {
                    status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
                }
            }
            else
            {
                status = CY_RRAM_ACQUIRE_PC_LOCK_FAIL;
            }
        }
    }
    else
    {
        status = CY_RRAM_BAD_PARAM;
    }

