PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_rram.c
    return status;
}


#if (CY_CPU_CORTEX_M0P)
/*******************************************************************************
* Function Name : Cy_RRAM_Init
****************************************************************************//**
*
* Retrieves configuration settings from configuration space in Extra area.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_Init(RRAMC_Type * base, cy_en_rram_vmode_t vmode, bool retrvAlgoInfo)
{
    cy_en_rram_status_t status = CY_RRAM_SUCCESS;
    uint32_t timeout;

    if (NULL == base)
    {
        return CY_RRAM_BAD_PARAM;
    }

    /* Mask for Uncorrectable failure or no configuration retrieved errors. */
    uint32_t errorMask = _VAL2FLD(RRAMC_RRAM_SFR_NVM_STATUS_VERR, 0x04UL);

    /* Sets voltage/frequency mode */
    Cy_RRAM_SetVoltageMode(base, vmode);

    /* Starts "Retrieve configuration settings" sequence and waits until the sequence finishes. */
    Cy_RRAM_SetOperationMode(base, CY_RRAM_IDLE);
    Cy_RRAM_SetOperationMode(base, CY_RRAM_RETRIEVE_CONFIG);

    /* Retrieve the write algorithm information */
    RRAM_NVM_PROG(base) |= _VAL2FLD(RRAMC_RRAM_SFR_NVM_PROG_SELRCS, retrvAlgoInfo);

    /* Start operation with unchanged NVM_PROG.ACTION */
    Cy_RRAM_StartOperation(base);

    timeout = CY_RRAM_OPERATION_TIMEOUT / CY_RRAM_STATUS_CHECK_DELAY;

    /* Wait for the retrieve operation to finish. As per RRAM IP team,
    * there is no need for timeout as the state machine will definitely
    * return to non-busy state. As a safety measure this timeout is added */
    while (Cy_RRAM_IsBusy(base) && (0UL != timeout))
    {
        timeout--;
        Cy_SysLib_DelayCycles(CY_RRAM_STATUS_CHECK_DELAY);
    }

    if (timeout == 0UL)
    {
        return CY_RRAM_OPERATION_TIME_OUT_ERROR;
    }
    Cy_RRAM_StopOperation(base);

    /* Up to triple-bit fails are corrected by HW
       below check is for uncorrectable failure or no configuration retrieved errors*/
    if ((((uint32_t)CY_RRAM_GetFailBitInfo(base)) & errorMask) != ((uint32_t)CY_RRAM_NO_ERROR))
    {
        status =  CY_RRAM_INIT_FAIL;
    }

    return status;
}
#endif


/*******************************************************************************
* Function Name: Cy_RRAM_EnableWP
****************************************************************************//**
*
* Enables write protection for number of sectors starting with sector 0 in RRAM NVM region.
* Before calling this API, user need to call Cy_RRAM_GetWPLockState() API and
* make sure the write protection lock is not locked. Otherwise this API will return
* CY_RRAM_WPLOCK_ENABLED error.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_EnableWP(RRAMC_Type * base, uint32_t numSectors)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    CY_ASSERT_L2(CY_RRAM_SECTOR_COUNT_VALID(numSectors));

    if (NULL != base && numSectors > 0UL && numSectors <= (CY_RRAM_NVM_SIZE_KB / CY_RRAM_SECTOR_SIZE_KB))
    {
        /* Check the status of write protection lock */
        if (Cy_RRAM_GetWPLockState(base) == CY_RRAM_WP_UNLOCK)
        {

            uint32_t temp = RRAM_NVM_CONF1(base) & ~RRAMC_RRAM_SFR_NVM_CONF1_SECPROT_Msk;
            /* Erase and Update the number of sectors to be write protected */
            RRAM_NVM_CONF1(base) = temp | _VAL2FLD(RRAMC_RRAM_SFR_NVM_CONF1_SECPROT, numSectors);
            status = CY_RRAM_SUCCESS;
        }
        else
        {
            status = CY_RRAM_WPLOCK_ENABLED;
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_DisableWP
****************************************************************************//**
*
* Disables write protection for all sectors in RRAM NVM region.
* Before calling this API, user need to call Cy_RRAM_GetWPLockState() API and
* make sure the write protection lock is not locked. Otherwise this API will return
* CY_RRAM_WPLOCK_ENABLED error.
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_DisableWP(RRAMC_Type * base)
{
    cy_en_rram_status_t status = CY_RRAM_WPLOCK_ENABLED;

    if (NULL == base)
    {
        return CY_RRAM_BAD_PARAM;
    }

    /* Check the status of write protection lock */
    if (Cy_RRAM_GetWPLockState(base) == CY_RRAM_WP_UNLOCK)
    {
        /* Disable write protection on all sectors by writing SECPROT to 0 */
        RRAM_NVM_CONF1(base) &= ~RRAMC_RRAM_SFR_NVM_CONF1_SECPROT_Msk;
        status = CY_RRAM_SUCCESS;
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_RRAM_SetProtLockableRegion
****************************************************************************//**
*
* Sets the size of lockable region in PROTECTED_NVM region. If size is larger than
* PROTECTERD_NVM, the entire PROTECTED_NVM is lockable. The lockable region can be configured
* only if the protected nvm lock state is unlocked. The configured region is protected only when the
* protected nvm lock state is locked
*
*******************************************************************************/
cy_en_rram_status_t Cy_RRAM_SetProtLockableRegion(RRAMC_Type * base, uint32_t regionSize)
{
    cy_en_rram_status_t status = CY_RRAM_BAD_PARAM;

    if (NULL != base && regionSize > 0UL && regionSize <= CY_RRAM_PROTECTED_LOCK_REGION_LIMIT)
    {
        if (Cy_RRAM_GetProtLockState(base) == CY_RRAM_PROTECTED_UNLOCK)
        {
            /* Align regionSize to update valid data to register */
            RRAM_PROTECTED_LOCKABLE_LOCK(base) |=
                (((regionSize - 1UL) << RRAMC_RRAMC_PROTECTED_LOCKABLE_LOCK_PARTITION_SIZE_1_Pos) | (regionSize - 1UL));
            status = CY_RRAM_SUCCESS;
        }
        else
        {
            status = CY_RRAM_UPDATE_LOCKABLE_REGION_FAILED;
        }
    }

    return status;
}

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 14.3')

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')

#endif /* CY_IP_MXS22RRAMC */

/* [] END OF FILE */
